Revit 2027 API
ExporterIFCUtils.SortCurveLoops Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<IList<CurveLoop>> SortCurveLoops(
	IList<CurveLoop> loops
)
Public Shared Function SortCurveLoops (
	loops As IList(Of CurveLoop)
) As IList(Of IList(Of CurveLoop))
public:
static IList<IList<CurveLoop^>^>^ SortCurveLoops(
	IList<CurveLoop^>^ loops
)
static member SortCurveLoops :
        loops : IList<CurveLoop> -> IList<IList<CurveLoop>>
Parameters
loops IList<CurveLoop>
Return Value
IList<IList<CurveLoop>>
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace